### PYTHON 012 ###

### Preparing Mexico Data ###

In [3]:
import pandas as pd
from IPython.display import VimeoVideo
Import
The first part of any data science project is preparing your data, which means making sure its in the right place 
and format for you to conduct your analysis. 
The first step of any data preparation is importing your raw data and cleaning it.

If you look in the small-data directory on your machine, you'll see that the data for this project comes in three CSV files:
mexico-real-estate-1.csv, mexico-real-estate-2.csv, and mexico-real-estate-3.csv.


Task 1.2.1: Read these three files into three separate DataFrames named df1, df2, and df3, respectively.

What's a DataFrame?
What's a CSV file?
Read a CSV file into a DataFrame using pandas

SyntaxError: invalid syntax (Temp/ipykernel_12444/1759309663.py, line 4)

In [4]:
import pandas as pd

### Import ###

In [ ]:
The first part of any data science project is preparing your data,
which means making sure its in the right place and format for you to conduct your analysis. 
The first step of any data preparation is importing your raw data and cleaning it.

If you look in the small-data directory on your machine, you'll see that the data for this project comes in three CSV files: mexico-real-estate-1.csv, mexico-real-estate-2.csv, and mexico-real-estate-3.csv.

VimeoVideo("656321516", h="e85e3bf248", width=600)
Task 1.2.1: Read these three files into three separate DataFrames named df1, df2, and df3, respectively.

What's a DataFrame?
What's a CSV file?
Read a CSV file into a DataFrame using pandas

### Pandas: Getting Started ###

In [ ]:
Pandas
Pandas is a Python library used for working with datasets. It does that by helping us make sense of DataFrames, 
which are a form of two-dimensional structured data, like a table with columns and rows. But before we can do anything else,
we need to start with data in a CSV file.

### Importing Data ###

In [ ]:
CSV Files
CSV stands for Comma Separated Values, and it's a file type that allows data to be saved in a table. 
Data presented in a table is called structured data, because it adheres to the idea that there is a meaningful relationship between the columns and rows. A CSV might also show panel data, which is data that shows observations of the same behavior at various different times. The datasets we're using in this part of the course are all structured tables, but you'll see other arrangements of data as you move through your projects.

If you're familiar with the way that data tables look in spreadsheet applications like Excel, 
you might be surprised to see that raw CSV files don't look like that. 
If you came across a CSV file and opened it to see what it looked like, you'd see something like this:

property_type,department,lat,lon,area_m2,price_usd
house,Bogotá D.C,4.69,-74.048,187.0,"$330,899.98"
house,Bogotá D.C,4.695,-74.082,82.0,"$121,555.09"
house,Quindío,4.535,-75.676,235.0,"$219,474.47"
house,Bogotá D.C,4.62,-74.129,195.0,"$97,919.38"

### Dictionaries ###

In [ ]:
You can create a DataFrame from a Python dictionary using from_dict function.

In [5]:
import pandas as pd

data = {"col_1": [3, 2, 1, 0], "col_2": ["a", "b", "c", "d"]}
pd.DataFrame.from_dict(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [ ]:
By default, DataFrame will be created using keys as columns. Note the length of the values should be 
equal for each key for the code to work. We can also let keys to be index instead of the columns:

In [6]:
pd.DataFrame.from_dict(data, orient="index")

       0  1  2  3
col_1  3  2  1  0
col_2  a  b  c  d

In [7]:
pd.DataFrame.from_dict(data, orient="index")
We can also specify column names:

SyntaxError: invalid syntax (Temp/ipykernel_12444/1576984588.py, line 2)

In [8]:
pd.DataFrame.from_dict(data, orient = "index", columns = ["A", "B", "c", "D"])

       A  B  c  D
col_1  3  2  1  0
col_2  a  b  c  d

In [9]:
Practice

Try it yourself! Create a DataFrame called using the dictionary clothes and make the keys as index, 
and put column names as ['color','size']

clothes = {"shirt": ["red", "M"], "sweater": ["yellow", "L"], "jacket": ["black", "L"]}
​
​

SyntaxError: invalid syntax (Temp/ipykernel_12444/1514616562.py, line 3)

In [10]:
import pandas as pd

clothes = {"shirt": ["red", "M"], "sweater": ["yellow", "L"], "jacket": ["black", "L"]}
pd.DataFrame.from_dict(clothes)

  shirt sweater jacket
0   red  yellow  black
1     M       L      L

In [7]:
property_type,department,lat,lon,area_m2,price_usd
house,Bogotá D.C,4.69,-74.048,187.0,"$330,899.98"
house,Bogotá D.C,4.695,-74.082,82.0,"$121,555.09"
house,Quindío,4.535,-75.676,235.0,"$219,474.47"
house,Bogotá D.C,4.62,-74.129,195.0,"$97,919.38"

SyntaxError: invalid syntax (Temp/ipykernel_20336/2825970291.py, line 2)

## Task 1.2.1 ##
### Read these three files into three separate DataFrames named df1, df2, and df3, respectively. ###

In [11]:
import pandas as pd

In [12]:
df1 = pd.read_csv("mexico_real_estate-1.txt")
df2 = pd.read_csv("mexico_real_estate-2.txt")
df3 = pd.read_csv("mexico_real_estate-3.txt")

In [12]:
df1

,property_type,state,lat,lon,area_m2,price_usd
0,house,Estado de México,19.560181,-99.233528,150.0,"$67,965.56"
1,house,Nuevo León,25.688436,-100.198807,186.0,"$63,223.78"
2,apartment,Guerrero,16.767704,-99.764383,82.0,"$84,298.37"
3,apartment,Guerrero,16.829782,-99.911012,150.0,"$94,308.80"
4,house,Veracruz de Ignacio de la Llave,NaN,NaN,175.0,"$94,835.67"
...,...,...,...,...,...,...
695,house,Morelos,NaN,NaN,310.0,"$237,089.17"
696,house,Yucatán,21.050653,-89.558841,334.0,"$137,017.34"
697,house,Yucatán,21.343796,-89.262060,130.0,"$110,404.35"
698,apartment,Nuevo León,NaN,NaN,155.0,"$184,446.42"
699,house,Querétaro,20.587378,-100.418361,106.0,"$56,637.97"

In [13]:
df2

    property_type             state        lat         lon  area_m2  price_mxn
0       apartment        Nuevo León  25.721081 -100.345581     72.0  1300000.0
1       apartment            Puebla        NaN         NaN    190.0  2500000.0
2           house           Morelos  23.634501 -102.552788    360.0  5300000.0
3           house           Morelos        NaN         NaN     76.0   820000.0
4           house            Puebla        NaN         NaN    200.0  1100000.0
..            ...               ...        ...         ...      ...        ...
695         house           Morelos  18.917542  -98.963181    140.0  1450000.0
696         house  Distrito Federal  19.472128  -99.146697    190.0  1943000.0
697         house  Estado de México  19.234984  -99.558175    115.0  2100000.0
698         house            Puebla  18.918714  -98.426639     90.0   890000.0
699         house           Yucatán  21.075163  -89.516731    185.0  1695000.0

[700 rows x 6 columns]

In [14]:
df3

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71.0,48550.59
1,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233.0,168636.73
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300.0,86932.69
3,house,|México|Morelos|Temixco|Burgos Bugambilias|,NaN,275.0,263432.41
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84.0,68508.67
...,...,...,...,...,...
695,house,|México|Jalisco|Tlajomulco de Zúñiga|Tlajomulc...,"20.532264,-103.484418",175.0,121178.91
696,house,|México|Morelos|Jiutepec|,"18.9289862,-99.1802147",100.0,47417.83
697,house,|México|Yucatán|Mérida|,"21.0284038368,-89.6530058049",81.0,39524.23
698,house,|México|San Luis Potosí|San Luis Potosí|,"22.11830417,-101.0321938992",360.0,245050.24
699,house,|México|Estado de México|Toluca|Metepec|,"19.233201,-99.558519",115.0,110667.85

## Clean df1 ##
### Now that you have your three DataFrames, it's time to inspect them to see if they need any cleaning. 
Let's look at them one-by-one.

### Task 1.2.2: 
### Inspect df1 by looking at its shape attribute. Then use the info method to see the data types and number of  missing values for each column. Finally, use the head method to determine to look at the first five rows of your dataset.

### Inspect a DataFrame using the shape, info, and head in pandas.

In [ ]:
It looks like there are a couple of problems in this DataFrame that you need to solve. First, there are many rows with NaN 
values in the "lat" and "lon" columns. Second, the data type for the "price_usd" column is object when it should be float.

In [ ]:
Task 1.2.2: Inspect df1 by looking at its shape attribute. Then use the info method to see the data types and number of 
missing values for each column. Finally, use the head method to determine to look at the first five rows of your dataset.

Inspect a DataFrame using the shape, info, and head in pandas

In [15]:
df1.shape

(700, 6)

In [16]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        700 non-null    float64
 5   price_usd      700 non-null    object
dtypes: float64(3), object(3)
memory usage: 32.9+ KB

df1.tail(7)

In [17]:
df1.head()

,property_type,state,lat,lon,area_m2,price_usd
0,house,Estado de México,19.560181,-99.233528,150.0,"$67,965.56"
1,house,Nuevo León,25.688436,-100.198807,186.0,"$63,223.78"
2,apartment,Guerrero,16.767704,-99.764383,82.0,"$84,298.37"
3,apartment,Guerrero,16.829782,-99.911012,150.0,"$94,308.80"
4,house,Veracruz de Ignacio de la Llave,NaN,NaN,175.0,"$94,835.67"

In [18]:
df1.describe()

              lat         lon     area_m2
count  583.000000  583.000000  700.000000
mean    20.677211  -98.394698  171.708571
std      2.563123    4.797798   78.267786
min     16.717077 -117.033916   60.000000
25%     19.198379 -100.344878  105.750000
50%     19.559799  -99.180214  160.000000
75%     21.096664  -97.911407  220.000000
max     32.665619  -86.767539  385.000000

In [19]:
df1.head(2)

  property_type             state        lat         lon  area_m2   price_usd
0         house  Estado de México  19.560181  -99.233528    150.0  $67,965.56
1         house        Nuevo León  25.688436 -100.198807    186.0  $63,223.78

In [ ]:
df1.tail()

In [ ]:
It looks like there are a couple of problems in this DataFrame that you need to solve. 
First, there are many rows with NaN values in the "lat" and "lon" columns.
Second, the data type for the "price_usd" column is object when it should be float.

In [ ]:
Task 1.2.3: Clean df1 by dropping rows with NaN values. Then remove the "$" and "," characters from "price_usd" and recast 
the values in the column as floats.

What's a data type?
Drop rows with missing values from a DataFrame using pandas.
Replace string characters in a column using pandas.
Recast a column as a different data type in pandas.

## TASK1.2.3 Clean df1 by dropping rows with NaN values. ## 
### Then remove the "$" and "," caharacters fronm "price_usd" and recast the values in the column as float. ###

In [ ]:
# Remove "NaN" (Not a Number) values  #

In [ ]:
The first part of any data science project is preparing your data, which means making sure its in the right place and format
for you to conduct your analysis. The first step of any data preparation is importing your raw data and cleaning it.

If you look in the small-data directory on your machine, you'll see that the data for this project comes in three CSV files:
mexico-real-estate-1.csv, mexico-real-estate-2.csv, and mexico-real-estate-3.csv.

In [20]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        700 non-null    float64
 5   price_usd      700 non-null    object
dtypes: float64(3), object(3)
memory usage: 32.9+ KB

In [21]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            571 non-null    float64
 3   lon            571 non-null    float64
 4   area_m2        700 non-null    float64
 5   price_mxn      700 non-null    float64
dtypes: float64(4), object(2)
memory usage: 32.9+ KB

In [22]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   property_type            700 non-null    object
 1   place_with_parent_names  700 non-null    object
 2   lat-lon                  582 non-null    object
 3   area_m2                  700 non-null    float64
 4   price_usd                700 non-null    float64
dtypes: float64(2), object(3)
memory usage: 27.5+ KB

In [ ]:
#  Removing missing values eg Nullvalues by generating a new Dataframe without missing vaules#
df1.dropna()
df1.info()

In [23]:
df1.shape

(700, 6)

In [24]:
#  Removing missing values and displaying the first five entries#
df1.dropna()
df1.info()

df1["price_usd"].head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 583 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  583 non-null    object
 1   state          583 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        583 non-null    float64
 5   price_usd      583 non-null    object
dtypes: float64(3), object(3)
memory usage: 31.9+ KB

0     $67,965.56
1     $63,223.78
2     $84,298.37
3     $94,308.80
5    $105,191.37
Name: price_usd, dtype: object

In [24]:
#  Removing String or noises eg $ #
df1.dropna()
df1.info()
df1["price_usd"].str.replace("$", "", regex=False).head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        700 non-null    float64
 5   price_usd      700 non-null    object
dtypes: float64(3), object(3)
memory usage: 32.9+ KB

0    67,965.56
1    63,223.78
2    84,298.37
3    94,308.80
4    94,835.67
Name: price_usd, dtype: object

In [25]:
#  Removing String or noises eg $ and , #
df1.dropna()
df1.info()
df1["price_usd"].str.replace("$", "", regex=False).str.replace(",", "").head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        700 non-null    float64
 5   price_usd      700 non-null    object
dtypes: float64(3), object(3)
memory usage: 32.9+ KB

0    67965.56
1    63223.78
2    84298.37
3    94308.80
4    94835.67
Name: price_usd, dtype: object

In [27]:
#  Removing String or noises eg $ and , and recast the datatype as float instead of object#
df1.dropna()
df1.info()
df1["price_usd"].str.replace("$", "", regex=False).str.replace(",", "").astype(float).head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        700 non-null    float64
 5   price_usd      700 non-null    object
dtypes: float64(3), object(3)
memory usage: 32.9+ KB

0    67965.56
1    63223.78
2    84298.37
3    94308.80
4    94835.67
Name: price_usd, dtype: float64

In [29]:
# Remove "NaN" (Not a Number) -  values  #
#df1.dropna(Inplace =True)

# Transform price from object to float #
df1["price_usd"] = (
    df1["price_usd"]
    .str.replace("$", "", regex=False)
    .str.replace(",", "")
    .astype(float).head()
)

In [30]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        700 non-null    float64
 5   price_usd      5 non-null      float64
dtypes: float64(4), object(2)
memory usage: 32.9+ KB

In [31]:
df1["price_usd"]

0      67965.56
1      63223.78
2      84298.37
3      94308.80
4      94835.67
         ...
695         NaN
696         NaN
697         NaN
698         NaN
699         NaN
Name: price_usd, Length: 700, dtype: float64

In [32]:
df2.shape

(700, 6)

In [33]:
df3.shape

(700, 5)

In [34]:
#  Removing missing values eg Nullvalues without generating a new Data Frame #
df1.dropna(inplace = True)
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  4 non-null      object
 1   state          4 non-null      object
 2   lat            4 non-null      float64
 3   lon            4 non-null      float64
 4   area_m2        4 non-null      float64
 5   price_usd      4 non-null      float64
dtypes: float64(4), object(2)
memory usage: 224.0+ bytes

In [35]:
# Remove "Nan" values #
df2.dropna(inplace=True)

#create a "price_usd" col
df2["price_usd"] = (df2["price_mxn"] / 19).round(2)

df2.head()

,property_type,state,lat,lon,area_m2,price_mxn,price_usd
0,apartment,Nuevo León,25.721081,-100.345581,72.0,1300000.0,68421.05
2,house,Morelos,23.634501,-102.552788,360.0,5300000.0,278947.37
6,apartment,Estado de México,19.272040,-99.572013,85.0,1250000.0,65789.47
7,house,San Luis Potosí,22.138882,-100.996510,158.0,2120000.0,111578.95
8,apartment,Distrito Federal,19.394558,-99.129707,65.0,758190.0,39904.74

In [36]:
df1["price_usd"].head()

0    67965.56
1    63223.78
2    84298.37
3    94308.80
Name: price_usd, dtype: float64

In [ ]:
Task 1.2.4: First, drop rows with NaN values in df2. Next, use the "price_mxn" column to create a new column named "price_usd".
(Keep in mind that, when this data was collected in 2014, a dollar cost 19 pesos.) Finally, drop the "price_mxn" from the 
DataFrame.

Drop rows with missing values from a DataFrame using pandas.
Create new columns derived from existing columns in a DataFrame using pandas.
Drop a column from a DataFrame using pandas.

In [39]:
df2.info

<bound method DataFrame.info of     property_type             state        lat         lon  area_m2  \
0       apartment        Nuevo León  25.721081 -100.345581     72.0
2           house           Morelos  23.634501 -102.552788    360.0
6       apartment  Estado de México  19.272040  -99.572013     85.0
7           house   San Luis Potosí  22.138882 -100.996510    158.0
8       apartment  Distrito Federal  19.394558  -99.129707     65.0
..            ...               ...        ...         ...      ...
695         house           Morelos  18.917542  -98.963181    140.0
696         house  Distrito Federal  19.472128  -99.146697    190.0
697         house  Estado de México  19.234984  -99.558175    115.0
698         house            Puebla  18.918714  -98.426639     90.0
699         house           Yucatán  21.075163  -89.516731    185.0

     price_mxn  price_usd
0    1300000.0   68421.05
2    5300000.0  278947.37
6    1250000.0   65789.47
7    2120000.0  111578.95
8     758190.0   39904.74
..         ...        ...
695  1450000.0   76315.79
696  1943000.0  102263.16
697  2100000.0  110526.32
698   890000.0   46842.11
699  1695000.0   89210.53

[571 rows x 7 columns]>

In [40]:
df2.shape

(571, 7)

In [41]:
df2.head()

,property_type,state,lat,lon,area_m2,price_mxn,price_usd
0,apartment,Nuevo León,25.721081,-100.345581,72.0,1300000.0,68421.05
2,house,Morelos,23.634501,-102.552788,360.0,5300000.0,278947.37
6,apartment,Estado de México,19.272040,-99.572013,85.0,1250000.0,65789.47
7,house,San Luis Potosí,22.138882,-100.996510,158.0,2120000.0,111578.95
8,apartment,Distrito Federal,19.394558,-99.129707,65.0,758190.0,39904.74

In [42]:
df2.tail()

,property_type,state,lat,lon,area_m2,price_mxn,price_usd
695,house,Morelos,18.917542,-98.963181,140.0,1450000.0,76315.79
696,house,Distrito Federal,19.472128,-99.146697,190.0,1943000.0,102263.16
697,house,Estado de México,19.234984,-99.558175,115.0,2100000.0,110526.32
698,house,Puebla,18.918714,-98.426639,90.0,890000.0,46842.11
699,house,Yucatán,21.075163,-89.516731,185.0,1695000.0,89210.53

In [43]:
df2.describe()

              lat         lon     area_m2     price_mxn      price_usd
count  571.000000  571.000000  571.000000  5.710000e+02     571.000000
mean    20.983555  -99.012350  172.129597  2.188709e+06  115195.212452
std      2.959004    5.227166   79.951591  1.226342e+06   64544.318609
min     16.228815 -117.038495   60.000000  6.300000e+05   33157.890000
25%     19.287224 -100.442642  110.000000  1.255000e+06   66052.630000
50%     20.302476  -99.201675  157.000000  1.860000e+06   97894.740000
75%     21.156042  -98.244797  228.000000  2.850000e+06  150000.000000
max     32.647057  -86.817017  383.000000  6.100000e+06  321052.630000

In [ ]:
Clean df3
Great work! We're now on the final DataFrame. Use the same shape, info and head commands to inspect the df3. 
Do you see any familiar issues?

You'll notice that we still have NaN values, but there are two new problems:

Instead of separate "lat" and "lon" columns, there's a single "lat-lon" column.
Instead of a "state" column, there's a "place_with_parent_names" column.
We need the resolve these problems so that df3 has the same columns in the same format as df1 and df2.

In [ ]:
**Task 1.2.5:** Drop rows with `NaN` values in `df3`. Then use the [`split`](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.split.html)
method to create two new columns from `"lat-lon"` named `"lat"` and `"lon"`, respectively.

- [Drop rows with missing values from a DataFrame using pandas.](../%40textbook/03-pandas-getting-started.ipynb#Dropping-Rows)
- [Split the strings in one column to create another using pandas.](../%40textbook/03-pandas-getting-started.ipynb#Splitting-Strings)

In [44]:
df3.shape

(700, 5)

In [45]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   property_type            700 non-null    object
 1   place_with_parent_names  700 non-null    object
 2   lat-lon                  582 non-null    object
 3   area_m2                  700 non-null    float64
 4   price_usd                700 non-null    float64
dtypes: float64(2), object(3)
memory usage: 27.5+ KB

In [46]:
df3.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71.0,48550.59
1,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233.0,168636.73
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300.0,86932.69
3,house,|México|Morelos|Temixco|Burgos Bugambilias|,NaN,275.0,263432.41
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84.0,68508.67

In [47]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   property_type            700 non-null    object
 1   place_with_parent_names  700 non-null    object
 2   lat-lon                  582 non-null    object
 3   area_m2                  700 non-null    float64
 4   price_usd                700 non-null    float64
dtypes: float64(2), object(3)
memory usage: 27.5+ KB

In [48]:
df3[["lat", "lon"]] = df3["lat-lon"].str.split(",", expand = True).head()
df3.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd,lat,lon
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71.0,48550.59,19.52589,-99.151703
1,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233.0,168636.73,19.2640539,-99.5727534
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300.0,86932.69,19.268629,-99.671722
3,house,|México|Morelos|Temixco|Burgos Bugambilias|,NaN,275.0,263432.41,NaN,NaN
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84.0,68508.67,19.511938,-96.871956

In [ ]:
Task 1.2.6: Use the split method again, this time to extract the state for every house. (Note that the state name always 
appears after "México|" in each string.) Use this information to create a "state" column. Finally, drop 
the "place_with_parent_names" and "lat-lon" columns from the DataFrame.

Split the strings in one column to create another using pandas.
Drop a column from a DataFrame using pandas.

In [ ]:
Concatenate DataFrames
Great work! You have three clean DataFrames, and now 
it's time to combine them into a single DataFrame so that you can conduct your analysis.

In [ ]:
Task 1.2.7: Use pd.concat to concatenate df1, df2, df3 as new DataFrame named df. Your new DataFrame should have 1,736 row
and 6 columns:"property_type", "state", "lat", "lon", "area_m2", "price_usd", and "price_per_m2".

Concatenate two or more DataFrames using pandas.

In [49]:
df = pd.concat([df1, df2, df3])
print(df.shape)
df.head()

(1275, 9)

,property_type,state,lat,lon,area_m2,price_usd,price_mxn,place_with_parent_names,lat-lon
0,house,Estado de México,19.560181,-99.233528,150.0,67965.56,NaN,NaN,NaN
1,house,Nuevo León,25.688436,-100.198807,186.0,63223.78,NaN,NaN,NaN
2,apartment,Guerrero,16.767704,-99.764383,82.0,84298.37,NaN,NaN,NaN
3,apartment,Guerrero,16.829782,-99.911012,150.0,94308.80,NaN,NaN,NaN
0,apartment,Nuevo León,25.721081,-100.345581,72.0,68421.05,1300000.0,NaN,NaN

## Save df ##
The data is clean and in a single DataFrame, 
and now you need to save it as a CSV file so that you can examine it in your exploratory data analysis.

In [ ]:
Task 1.2.8: Save df as a CSV file using the to_csv method. The file path should be "./data/mexico-real-estate-clean.csv". Be sure to set the index argument to False.

What's a CSV file?
Save a DataFrame as a CSV file using pandas.

In [ ]:
df.to_csv("data/mexico-real-estate-clean.csv", index=False)

## Calculating Mean, Median, and Mode in Python ##

In [ ]:
When we're trying to describe and summarize a sample of data, we probably start by finding the mea
n (or average), the median, and the mode of the data. These are central tendency measures and are often our first look at a dataset.

In this tutorial, we'll learn how to find or compute the mean, the median, and the mode in Python. We'll first code a Python function for each measure followed by using Python's statistics module to accomplish the same task.

With this knowledge, we'll be able to take a quick look at our datasets and get an idea of the general tendency of data.

Calculating the Mean of a Sample
If we have a sample of numeric values, then its mean or the average is the total sum of the values (or observations) divided by the number of values.

Say we have the sample [4, 8, 6, 5, 3, 2, 8, 9, 2, 5]. We can calculate its mean by performing the operation:

(4 + 8 + 6 + 5 + 3 + 2 + 8 + 9 + 2 + 5) / 10 = 5.2

The mean (arithmetic mean) is a general description of our data. Suppose you buy 10 pounds of tomatoes. 
When you count the tomatoes at home, you get 25 tomatoes. In this case, you can say that the average weight of a tomato is 0.4 pounds. 
That would be a good description of your tomatoes.

## Calculating the Mean With Python ##

In [ ]:
To calculate the mean of a sample of numeric data, we'll use two of Python's built-in functions. One to calculate the total sum of the values and another to calculate the length of the sample.

The first function is sum(). This built-in function takes an iterable of numeric values and returns their total sum.

The second function is len(). This built-in function returns the length of an object. len() can take sequences (string, bytes, tuple, list, or range) or collections (dictionary, set, or frozen set) as an argument.

Here's how we can calculate the mean:

In [ ]:
>>> def my_mean(sample):
...     return sum(sample) / len(sample)
...

>>> my_mean([4, 8, 6, 5, 3, 2, 8, 9, 2, 5])
5.2

In [ ]:
>>> import statistics

>>> statistics.mean([4, 8, 6, 5, 3, 2, 8, 9, 2, 5])
5.2

In [ ]:
import statistics 

statistics.mean([4, 8, 6, 5, 3, 2, 8, 9, 2, 5])

In [ ]:
We just need to import the statistics module and then call mean() with our sample as an argument. 
That will return the mean of the sample. This is a quick way of finding the mean using Python.

In [ ]:
Finding the Median of a Sample

In [ ]:
The median of a sample of numeric data is the value that lies in the middle when we sort the data. The data may be sorted in ascending or descending order, the median remains the same.

To find the median, we need to:

Sort the sample
Locate the value in the middle of the sorted sample
When locating the number in the middle of a sorted sample, we can face two kinds of situations:

If the sample has an odd number of observations, then the middle value in the sorted sample is the median
If the sample has an even number of observations, then we'll need to calculate the mean of the two middle values in the sorted sample
If we have the sample [3, 5, 1, 4, 2] and want to find its median, then we first sort the sample to [1, 2, 3, 4, 5]. The median would be 3 since that's the value in the middle.

On the other hand, if we have the sample [1, 2, 3, 4, 5, 6], then its median will be (3 + 4) / 2 = 3.5.

Let's take a look at how we can use Python to calculate the median.

In [ ]:
Finding the Median With Python
To find the median, we first need to sort the values in our sample. We can achieve that using the built-in sorted() function. sorted() takes an iterable and returns a sorted list containing the same values of the original iterable.

The second step is to locate the value that lies in the middle of the sorted sample. To locate that value in a sample with an odd number of observations, we can divide the number of observations by 2. The result will be the index of the value in the middle of the sorted sample.

Since a division operator (/) returns a float number, we'll need to use a floor division operator, (//) to get an integer. So, we can use it as an index in an indexing operation ([]).

If the sample has an even number of observations, then we need to locate the two middle values. Say we have the sample [1, 2, 3, 4, 5, 6]. If we divide its length (6) by 2 using a floor division, then we get 3. That's the index of our upper-middle value (4). To find the index of our lower-middle value (3), we can decrement the index of the upper-middle value by 1.

Let's put all these together in function that calculates the median of a sample. Here's a possible implementation:

In [ ]:
>>> def my_median(sample):
...     n = len(sample)
...     index = n // 2
...     # Sample with an odd number of observations
...     if n % 2:
...         return sorted(sample)[index]
...     # Sample with an even number of observations
...     return sum(sorted(sample)[index - 1:index + 1]) / 2
...

>>> my_median([3, 5, 1, 4, 2])
3

>>> my_median([3, 5, 1, 4, 2, 6])
3.5

In [ ]:
This function takes a sample of numeric values and returns its median. We first find the length of the sample, n. Then, we calculate the index of the middle value (or upper-middle value) by dividing n by 2.

The if statement checks if the sample at hand has an odd number of observations. If so, then the median is the value at index.

The final return runs if the sample has an even number of observations. In that case, we find the median by calculating the mean of the two middle values.

Note that the slicing operation [index - 1:index + 1] gets two values. The value at index - 1 and the value at index because slicing operations exclude the value at the final index (index + 1).

Using Python's median()
Python's statistics.median() takes a sample of data and returns its median. Here's how the method works:

In [ ]:
Note that median() automatically handles the calculation of the median for samples with either an odd or an even number of observations.

## Finding the Mode of a Sample ##

In [ ]:

The mode is the most frequent observation (or observations) in a sample. If we have the sample [4, 1, 2, 2, 3, 5], then its mode is 2 because 2 appears two times in the sample whereas the other elements only appear once.

The mode doesn't have to be unique. Some samples have more than one mode. Say we have the sample [4, 1, 2, 2, 3, 5, 4]. This sample has two modes - 2 and 4 because they're the values that appear more often and both appear the same number of times.

The mode is commonly used for categorical data. Common categorical data types are:

boolean - Can take only two values like in true or false, male or female
nominal - Can take more than two values like in American - European - Asian - African
ordinal - Can take more than two values but the values have a logical order like in few - some - many
When we're analyzing a dataset of categorical data, we can use the mode to know which category is the most common in our data.

In [ ]:
>>> from collections import Counter

>>> def my_mode(sample):
...     c = Counter(sample)
...     return [k for k, v in c.items() if v == c.most_common(1)[0][1]]
...

>>> my_mode(["male", "male", "female", "male"])
['male']

>>> my_mode(["few", "few", "many", "some", "many"])
['few', 'many']

>>> my_mode([4, 1, 2, 2, 3, 5])
[2]

>>> my_mode([4, 1, 2, 2, 3, 5, 4])
[4, 2]

In [ ]:
We first count the observations in the sample using a Counter object (c). Then, we use a list comprehension to create a list containing the observations that appear the same number of times in the sample.

Since .most_common(1) returns a list with one tuple of the form (observation, count), we need to get the observation at index 0 in the list and then the item at index 1 in the nested tuple. This can be done with the expression c.most_common(1)[0][1]. That value is the first mode of our sample.

Note that the comprehension's condition compares the count of each observation (v) with the count of the most common observation (c.most_common(1)[0][1]). This will allow us to get multiple observations (k) with the same count in the case of a multi-mode sample.

Using Python's mode()
Python's statistics.mode() takes some data and returns its (first) mode. Let's see how we can use it:

In [ ]:
>>> import statistics

>>> statistics.mode([4, 1, 2, 2, 3, 5])
2

>>> statistics.mode([4, 1, 2, 2, 3, 5, 4])
4

>>> st.mode(["few", "few", "many", "some", "many"])
'few'

In [ ]:

With a single-mode sample, Python's mode() returns the most common value, 2. However, in the proceeding two examples, it returned 4 and few. These samples had other elements occurring the same number of times, but they weren't included.

Since Python 3.8 we can also use statistics.multimode() which accepts an iterable and returns a list of modes.

Here's an example of how to use multimode():

In [ ]:
>>> import statistics

>>> statistics.multimode([4, 1, 2, 2, 3, 5, 4])
[4, 2]

>>> statistics.multimode(["few", "few", "many", "some", "many"])
['few', 'many']

>>> st.multimode([4, 1, 2, 2, 3, 5])
[2]

### How To Create a Pandas DataFrame ###

In [ ]:
Note that in this post, most of the times, the libraries that you need have already been loaded in. The Pandas library is usually imported under the alias pd, while the NumPy library is loaded as np. Remember that when you code in your own data science environment, you shouldn’t forget this import step, which you write just like this:

import numpy as np
import pandas as pd
Now that there is no doubt in your mind about what DataFrames are, what they can do and how they differ from other structures, it’s time to tackle the most common questions that users have about working with them!

1. How To Create a Pandas DataFrame
Obviously, making your DataFrames is your first step in almost anything that you want to do when it comes to data munging in Python. 
Sometimes, you will want to start from scratch, 
but you can also convert other data structures, such as lists or NumPy arrays, to Pandas DataFrames. In this section, you’ll only cover the latter. 
However, if you want to read more on making empty DataFrames that you can fill up with data later, go to question 7.

Among the many things that can serve as input to make a ‘DataFrame’, a NumPy ndarray is one of them. 
To make a data frame from a NumPy array, you can just pass it to the DataFrame() function in the data argument.

In [ ]:
import numpy as np
import pandas as pd

data = np.array([['','Col1','Col2'],
                ['Row1',1,2],
                ['Row2',3,4]])
                
print(pd.DataFrame(data=data[1:,1:],
                  index=data[1:,0],
                  columns=data[0,1:]))

In [ ]:
Pay attention to how the code chunks above select elements from the NumPy array to construct the DataFrame: 
you first select the values that are contained in the lists that start with Row1 and Row2, 
then you select the index or row numbers Row1 and Row2 and then the column names Col1 and Col2.

In [ ]:
These two options give you slightly different information on your DataFrame: the shape property will provide you with the 
dimensions of your DataFrame. That means that you will get to know the width and the height of your DataFrame. 
On the other hand, the len() function, in combination with the index property, will only give you information on the height
of your DataFrame.

This all is totally not extraordinary, though, as you explicitly give in the index property.

You could also use df[0].count() to get to know more about the height of your DataFrame, but this will exclude the NaN values (if there are any).
That is why calling .count() on your DataFrame is not always the better option.

If you want more information on your DataFrame columns, you can always execute list(my_dataframe.columns.values). 
Try this out for yourself in the DataCamp Light block above!

In [ ]:
Now, let’s say you have a DataFrame like this one:

In [ ]:
  A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
# Using `iloc[]`
print(df.iloc[0][0])

# Using `loc[]`
print(df.loc[0]['A'])

# Using `at[]`
print(df.at[0,'A'])

# Using `iat[]`
print(df.iat[0,0])

In [ ]:
# Use `iloc[]` to select row `0`
print(df.iloc[_])

# Use `loc[]` to select column `'A'`
print(df.loc[:,'_'])

In [ ]:
my_flowers = ["Acacia", "Begonia", "Carnation", "Dandelion"]